[Killed] Block removal mutation
BookLendingApplication/src/Controllers/BooksController.cs:18:5
     private readonly IBookService _bookService;
 
     public BooksController(IBookService bookService)
-    {
-        _bookService = bookService;
-    }
+    {}
 
     /// <summary>
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.AddBook_ReturnsBadRequest_WhenBookExists; BookLendingApplication.Tests.Controllers.BooksControllerTests.AddBook_ReturnsCreated_WhenBookDoesNotExist; BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_ReturnsBadRequest_WhenBookNotAvailable

[Killed] Equality mutation
BookLendingApplication/src/Controllers/BooksController.cs:61:17
         try
         {
             var book = await _bookService.GetBookById(id);
-            if (book == null)
+            if (book != null)
                 return NotFound(ApiResponse<Book>.Failure("Book not found", "Book not found", 404));
             return Ok(ApiResponse<Book>.Success(book, "Book retrieved successfully"));
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.GetBook_ReturnsNotFound_WhenBookDoesNotExist; BookLendingApplication.Tests.Controllers.BooksControllerTests.GetBook_ReturnsOk_WhenBookExists

[Killed] String mutation
BookLendingApplication/src/Controllers/BooksController.cs:63:55
             var book = await _bookService.GetBookById(id);
             if (book == null)
                 return NotFound(ApiResponse<Book>.Failure("Book not found", "Book not found", 404));
-            return Ok(ApiResponse<Book>.Success(book, "Book retrieved successfully"));
+            return Ok(ApiResponse<Book>.Success(book, ""));
         }
         catch (Exception ex)
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.GetBook_ReturnsOk_WhenBookExists

[Killed] Equality mutation
BookLendingApplication/src/Controllers/BooksController.cs:86:17
         try
         {
             var bookAvailable = await BookExists(book.Id);
-            if (bookAvailable != null)
+            if (bookAvailable == null)
             {
                 return BadRequest("Book Id already available in records. Please provide different Id");
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.AddBook_ReturnsBadRequest_WhenBookExists; BookLendingApplication.Tests.Controllers.BooksControllerTests.AddBook_ReturnsCreated_WhenBookDoesNotExist; BookLendingApplication.Tests.Controllers.BooksControllerTests.AddBook_WhenException_ReturnsBadRequest

[Killed] String mutation
BookLendingApplication/src/Controllers/BooksController.cs:93:52
 
             var newBook = await _bookService.AddBook(book);
             return CreatedAtAction(nameof(GetBook), new { id = newBook.Id }, 
-                ApiResponse<Book>.Success(newBook, "Book added successfully", 201));
+                ApiResponse<Book>.Success(newBook, "", 201));
         }
         catch (Exception ex)
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.AddBook_ReturnsCreated_WhenBookDoesNotExist

[Killed] Equality mutation
BookLendingApplication/src/Controllers/BooksController.cs:116:17
         try
         {
             var book = await BookExists(id);
-            if (book == null)
+            if (book != null)
             {
                 return NotFound("Book does not exist in records. Please verify Id again.");
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_ReturnsBadRequest_WhenBookNotAvailable; BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_ReturnsBadRequest_WhenCheckoutFails; BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_ReturnsNotFound_WhenBookDoesNotExist

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
BookLendingApplication/src/Controllers/BooksController.cs:121:17
                 return NotFound("Book does not exist in records. Please verify Id again.");
             }
 
-            if (!book.IsAvailable) return BadRequest("Book not available for checkout.");
+            if (book.IsAvailable) return BadRequest("Book not available for checkout.");
 
             var updatedBook = await _bookService.Checkout(book);
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_ReturnsBadRequest_WhenBookNotAvailable; BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_ReturnsBadRequest_WhenCheckoutFails; BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_ReturnsOk_WhenCheckoutSucceeds

[Killed] Equality mutation
BookLendingApplication/src/Controllers/BooksController.cs:124:17
             if (!book.IsAvailable) return BadRequest("Book not available for checkout.");
 
             var updatedBook = await _bookService.Checkout(book);
-            if (updatedBook == null)
+            if (updatedBook != null)
                 return BadRequest(ApiResponse<Book>.Failure("Book not available for checkout.", "Checkout failed"));
             return Ok(ApiResponse<Book>.Success(book, "Book checked out successfully."));
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_ReturnsBadRequest_WhenCheckoutFails; BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_ReturnsOk_WhenCheckoutSucceeds

[Killed] String mutation
BookLendingApplication/src/Controllers/BooksController.cs:151:33
             var book = await BookExists(id);
             if (book == null)
             {
-                return NotFound("Book does not exist in records. Please re-try with correct book Id.");
+                return NotFound("");
             }
 
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.ReturnBook_ReturnsNotFound_WhenBookDoesNotExist

[Killed] Equality mutation
BookLendingApplication/src/Controllers/BooksController.cs:155:17
             }
 
             var updatedBook = await _bookService.Return(book);
-            if (updatedBook == null)
+            if (updatedBook != null)
                 return BadRequest(ApiResponse<Book>.Failure("Return failed.", "Return failed."));
             return Ok(ApiResponse<Book>.Success(updatedBook, "Book returned successfully."));
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.ReturnBook_ReturnsBadRequest_WhenReturnFails; BookLendingApplication.Tests.Controllers.BooksControllerTests.ReturnBook_ReturnsOk_WhenReturnSucceeds

[Killed] String mutation
BookLendingApplication/src/Controllers/BooksController.cs:156:79
 
             var updatedBook = await _bookService.Return(book);
             if (updatedBook == null)
-                return BadRequest(ApiResponse<Book>.Failure("Return failed.", "Return failed."));
+                return BadRequest(ApiResponse<Book>.Failure("Return failed.", ""));
             return Ok(ApiResponse<Book>.Success(updatedBook, "Book returned successfully."));
         }
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.ReturnBook_ReturnsBadRequest_WhenReturnFails

[Killed] String mutation
BookLendingApplication/src/Controllers/BooksController.cs:157:62
             var updatedBook = await _bookService.Return(book);
             if (updatedBook == null)
                 return BadRequest(ApiResponse<Book>.Failure("Return failed.", "Return failed."));
-            return Ok(ApiResponse<Book>.Success(updatedBook, "Book returned successfully."));
+            return Ok(ApiResponse<Book>.Success(updatedBook, ""));
         }
         catch (Exception ex)
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.ReturnBook_ReturnsOk_WhenReturnSucceeds

[Killed] Block removal mutation
BookLendingApplication/src/Controllers/BooksController.cs:171:5
     /// <param name="id"></param>
     /// <returns></returns>
     private async Task<Book?> BookExists(Guid id)
-    {
-        return await _bookService.GetBookById(id);
-    }
+    {}
 }
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.AddBook_ReturnsBadRequest_WhenBookExists; BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_ReturnsBadRequest_WhenBookNotAvailable; BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_ReturnsBadRequest_WhenCheckoutFails
