[Survived] String mutation
BookLendingApplication/src/Models/ApiResponse.cs:6:43
 public class ApiResponse<T>
 {
     public int Code { get; set; }
-    public string Message { get; set; } = string.Empty;
+    public string Message { get; set; } = "Stryker was here!";
     public T? Data { get; set; }
     public string? Error { get; set; }

[Killed] Object initializer mutation
BookLendingApplication/src/Models/ApiResponse.cs:37:16
     /// <returns></returns>
     public static ApiResponse<T> Failure(string error, string message = "Error", int code = 400)
     {
-        return new ApiResponse<T>
-        {
-            Code = code,
-            Message = message,
-            Data = default,
-            Error = error
-        };
+        return new ApiResponse<T>
+{};
     }
 }
killedBy: BookLendingApplication.Tests.Controllers.BooksControllerTests.AddBook_WhenException_ReturnsBadRequest; BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_ReturnsBadRequest_WhenCheckoutFails; BookLendingApplication.Tests.Controllers.BooksControllerTests.CheckOutBook_WhenException_ReturnsBadRequest
