[Killed] Null coalescing mutation (remove right)
BookLendingApplication/src/Repositories/InMemoryBookRepository.cs:19:22
         public InMemoryBookRepository(IMemoryCache memoryCache)
         {
             _cache = memoryCache;
-            _books = _cache.Get<List<Book>>(CacheKey) ?? new List<Book>();
+            _books = _cache.Get<List<Book>>(CacheKey);
             _cache.Set(CacheKey, _books, TimeSpan.FromMinutes(10));
         }
killedBy: BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.GetAllAsync_ReturnsEmptyList_WhenNoBooks; BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.GetByIdAsync_ReturnsBook_WhenExists

[Survived] Null coalescing mutation (left to right)
BookLendingApplication/src/Repositories/InMemoryBookRepository.cs:19:22
         public InMemoryBookRepository(IMemoryCache memoryCache)
         {
             _cache = memoryCache;
-            _books = _cache.Get<List<Book>>(CacheKey) ?? new List<Book>();
+            _books = new List<Book>()?? _cache.Get<List<Book>>(CacheKey);
             _cache.Set(CacheKey, _books, TimeSpan.FromMinutes(10));
         }

[Survived] Statement mutation
BookLendingApplication/src/Repositories/InMemoryBookRepository.cs:20:13
         {
             _cache = memoryCache;
             _books = _cache.Get<List<Book>>(CacheKey) ?? new List<Book>();
-            _cache.Set(CacheKey, _books, TimeSpan.FromMinutes(10));
+            ;
         }
 

[Killed] Linq method mutation (FirstOrDefault() to First())
BookLendingApplication/src/Repositories/InMemoryBookRepository.cs:36:29
         /// <param name="id">book id</param>
         /// <returns>Returns book</returns>
         public Task<Book?> GetByIdAsync(Guid id) =>
-            Task.FromResult(_books.FirstOrDefault(b => b.Id == id));
+            Task.FromResult(_books.First(b => b.Id == id));
 
         /// <summary>
killedBy: BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.GetByIdAsync_ReturnsNull_WhenNotExists

[Killed] Equality mutation
BookLendingApplication/src/Repositories/InMemoryBookRepository.cs:36:56
         /// <param name="id">book id</param>
         /// <returns>Returns book</returns>
         public Task<Book?> GetByIdAsync(Guid id) =>
-            Task.FromResult(_books.FirstOrDefault(b => b.Id == id));
+            Task.FromResult(_books.FirstOrDefault(b => b.Id != id));
 
         /// <summary>
killedBy: BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.GetByIdAsync_ReturnsBook_WhenExists

[Killed] Linq method mutation (FirstOrDefault() to First())
BookLendingApplication/src/Repositories/InMemoryBookRepository.cs:45:28
         /// <returns>Returns book added/updated</returns>
         public Task<Book?> SaveAsync(Book book)
         {
-            var existing = _books.FirstOrDefault(x => x.Id == book.Id);
+            var existing = _books.First(x => x.Id == book.Id);
             if (existing is not null)
             {
killedBy: BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.GetByIdAsync_ReturnsBook_WhenExists; BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.SaveAsync_AddsBook_WhenNotExists; BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.SaveAsync_UpdatesBook_WhenExists

[Survived] Equality mutation
BookLendingApplication/src/Repositories/InMemoryBookRepository.cs:45:55
         /// <returns>Returns book added/updated</returns>
         public Task<Book?> SaveAsync(Book book)
         {
-            var existing = _books.FirstOrDefault(x => x.Id == book.Id);
+            var existing = _books.FirstOrDefault(x => x.Id != book.Id);
             if (existing is not null)
             {

[Killed] Equality mutation
BookLendingApplication/src/Repositories/InMemoryBookRepository.cs:46:17
         public Task<Book?> SaveAsync(Book book)
         {
             var existing = _books.FirstOrDefault(x => x.Id == book.Id);
-            if (existing is not null)
+            if (existing is null)
             {
                 existing.IsAvailable = book.IsAvailable;
killedBy: BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.GetByIdAsync_ReturnsBook_WhenExists; BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.SaveAsync_AddsBook_WhenNotExists; BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.SaveAsync_UpdatesBook_WhenExists

[Survived] Block removal mutation
BookLendingApplication/src/Repositories/InMemoryBookRepository.cs:47:13
         {
             var existing = _books.FirstOrDefault(x => x.Id == book.Id);
             if (existing is not null)
-            {
-                existing.IsAvailable = book.IsAvailable;
-            }
+            {}
             else
             {

[Killed] Statement mutation
BookLendingApplication/src/Repositories/InMemoryBookRepository.cs:52:17
             }
             else
             {
-                _books.Add(book);
+                ;
                 existing = _books.FirstOrDefault(x => x.Id == book.Id);
             }
killedBy: BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.GetByIdAsync_ReturnsBook_WhenExists; BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.SaveAsync_AddsBook_WhenNotExists; BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.SaveAsync_UpdatesBook_WhenExists

[Killed] Equality mutation
BookLendingApplication/src/Repositories/InMemoryBookRepository.cs:53:55
             else
             {
                 _books.Add(book);
-                existing = _books.FirstOrDefault(x => x.Id == book.Id);
+                existing = _books.FirstOrDefault(x => x.Id != book.Id);
             }
             return Task.FromResult(existing);
killedBy: BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.GetByIdAsync_ReturnsBook_WhenExists; BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.SaveAsync_AddsBook_WhenNotExists; BookLendingApplication.Tests.Repositories.InMemoryBookRepositoryTests.SaveAsync_UpdatesBook_WhenExists

[Survived] Linq method mutation (FirstOrDefault() to First())
BookLendingApplication/src/Repositories/InMemoryBookRepository.cs:53:28
             else
             {
                 _books.Add(book);
-                existing = _books.FirstOrDefault(x => x.Id == book.Id);
+                existing = _books.First(x => x.Id == book.Id);
             }
             return Task.FromResult(existing);
