[Killed] Block removal mutation
BookLendingApplication/src/Services/BookService.cs:14:5
     private readonly IBookRepository _bookRepository;
 
     public BookService(IBookRepository bookRepository)
-    {
-        _bookRepository = bookRepository;
-    }
+    {}
 
     /// <summary>
killedBy: BookLendingApplication.Tests.Services.BookServiceTests.AddBook_SavesAndReturnsBook; BookLendingApplication.Tests.Services.BookServiceTests.Checkout_SetsIsAvailableFalse_AndSaves; BookLendingApplication.Tests.Services.BookServiceTests.GetAllBooks_ReturnsBooks

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
BookLendingApplication/src/Services/BookService.cs:25:16
     /// <returns>Returns true if book is already checked out else returns false</returns>
     public static bool IsBookAlreadyCheckedOut(Book book)
     {
-        return !book.IsAvailable;
+        return book.IsAvailable;
     }
 
killedBy: BookLendingApplication.Tests.Services.BookServiceTests.IsBookAlreadyCheckedOut_ReturnsFalse_WhenAvailable; BookLendingApplication.Tests.Services.BookServiceTests.IsBookAlreadyCheckedOut_ReturnsTrue_WhenNotAvailable

[Killed] Block removal mutation
BookLendingApplication/src/Services/BookService.cs:33:5
     /// </summary>
     /// <returns>List of books</returns>
     public async Task<IEnumerable<Book>> GetAllBooks()
-    {
-        return await _bookRepository.GetAllAsync();
-    }
+    {}
 
     /// <summary>
killedBy: BookLendingApplication.Tests.Services.BookServiceTests.GetAllBooks_ReturnsBooks

[Killed] Block removal mutation
BookLendingApplication/src/Services/BookService.cs:43:5
     /// <param name="book">book</param>
     /// <returns>Returns book added</returns>
     public async Task<Book> AddBook(Book book)
-    {
-        return await _bookRepository.SaveAsync(book);
-    }
+    {}
 
     /// <summary>
killedBy: BookLendingApplication.Tests.Services.BookServiceTests.AddBook_SavesAndReturnsBook

[Killed] Block removal mutation
BookLendingApplication/src/Services/BookService.cs:53:5
     /// <param name="id">book</param>
     /// <returns>Returns book</returns>
     public async Task<Book?> GetBookById(Guid id)
-    {
-        return await _bookRepository.GetByIdAsync(id);
-    }
+    {}
 
     /// <summary>
killedBy: BookLendingApplication.Tests.Services.BookServiceTests.GetBookById_ReturnsBook

[Killed] Boolean mutation
BookLendingApplication/src/Services/BookService.cs:64:27
     /// <returns>Returns book checked out</returns>
     public async Task<Book> Checkout(Book book)
     {
-        book.IsAvailable= false;
+        book.IsAvailable= true;
         return  await _bookRepository.SaveAsync(book);
     }
killedBy: BookLendingApplication.Tests.Services.BookServiceTests.Checkout_SetsIsAvailableFalse_AndSaves

[Killed] Boolean mutation
BookLendingApplication/src/Services/BookService.cs:75:28
     /// <returns>Returns book returned</returns>
     public async Task<Book> Return(Book book)
     {
-        book.IsAvailable = true;
+        book.IsAvailable = false;
         return await _bookRepository.SaveAsync(book);
     }
killedBy: BookLendingApplication.Tests.Services.BookServiceTests.Return_SetsIsAvailableTrue_AndSaves
